In [1]:
import pandas as pd

In [2]:
pd.read_excel(r'C:\Users\Lenovo\Desktop\Data_Set 1.xlsx')

   Name        Batch  Roll no Address
0  Allen  Python-067        1   Noida
1    Bob     java-12       13  Mumbai
2   John  Python-067       24   Delhi

In [3]:
pd.read_csv(r'C:\Users\Lenovo\Desktop\Data_Set 2.csv')

   Name        Batch  Roll no   Address
0  Allen  Python-067        1     Noida
1    Bob     java-12       13    Mumbai
2   John  Python-067       24     Delhi
3   Alex     java-12       66      Pune
4    Tom  Python-067       78  Banglore

In [6]:
pd.read_csv(r'C:\Users\Lenovo\Desktop\Data_Set 2.csv',sep='\t')

  Name ,Batch,Roll no,Address
0    Allen,Python-067,1,Noida
1       Bob,java-12,13,Mumbai
2    John,Python-067,24,Delhi
3        Alex,java-12,66,Pune
4  Tom,Python-067,78,Banglore